/**
 * [卡片定義]
 */
define([], function () {
	var tmp_list = {};
	var cardDataList = {};
	//==卡片圖片位置==//
	cardDataList['img_path'] = 'ui/data/card/';
	/**
	 * [card_type 卡片分類]
	 * 		key 		[number] 類別編號
	 * 		name 		[string] 顯示名稱
	 * 		show_select	[blooean] 更多信用卡頁面是否顯示
	 * 		order		[number] 排序
	 * 		sub 		[array] 子選單
	 * @type {Object}
	 */
	tmp_list = {};
	tmp_list['V'] 	= {'key' : 'V' , 'name' : 'VISA'	 , 'sub' : [],
							'show_select' : false , 'order' : 7
						};
	tmp_list['M'] 	= {'key' : 'M' , 'name' : 'MASTER'	 , 'sub' : [],
							'show_select' : false , 'order' : 8
						};
	tmp_list['J'] 	= {'key' : 'J' , 'name' : 'JCB'		 , 'sub' : [],
							'show_select' : false , 'order' : 9
						};
	tmp_list['hot'] = {
		'key' : 'hot',
		'name' : '熱門推薦',
		'show_select' : true,
		'order' : 1,
		'sub' : [
			'679' ,
			'684' ,
			'894' ,
			'614' ,
			'893'
		],
		'sub_order' : ['614']
	};
	tmp_list['1'] = {
		'key' : '1',
		'name' : '一般信用卡',
		'show_select' : true,
		'order' : 2,
		'sub' : [
			'600',
			'610',
			'620',
			'630',
			'642',
			'670',
			'880',
			'613'
		]
	};
	tmp_list['2'] = {
		'key' : '2',
		'name' : '悠遊聯名信用卡',
		'show_select' : true,
		'order' : 3,
		'sub' : [
			'891' ,
			'882' ,
			'608' ,
			'881' ,
			'890',
			'679',
			'677',
			'678',
			'687',
			'614'
		]
	};
	tmp_list['3'] = {
			'key' : '3',
		'name' : '一卡通聯名信用卡',
		'show_select' : true,
		'order' : 4,
		'sub' : [
			'892',
			'893',
			'894'
		]
	};
	tmp_list['4'] = {
		'key' : '4',
		'name' : '漢來美食聯名卡',
		'show_select' : true,
		'order' : 5,
		'sub' : [
			'677' ,
			'893'
		]
	};
	tmp_list['5'] = {
		'key' : '5',
		'name' : '鹿港天后宮認同卡',
		'show_select' : true,
		'order' : 6,
		'sub' : [
			'894' ,
			'679'
		]
	};
	tmp_list['6'] = {
		'key' : '6',
		'name' : 'icash聯名卡',
		'show_select' : true,
		'order' : 7,
		'sub' : [
			'681',
			'684',
			'685'
		]
	};
	tmp_list['7'] = {
		'key' : '7',
		'name' : '合作社聯名卡',
		'show_select' : true,
		'order' : 8,
		'sub' : [
			'680',
			'682',
			'683',
			'686'
			// '680',
			// '682'
		]
	};
	//20181210新增“B2B個人採購卡“
	tmp_list['8'] = {
		'key' : '8',
		'name' : 'B2B個人採購卡',
		'show_select' : true,
		'order' : 9,
		'sub' : [
			'511'
		]
	};


	cardDataList['card_type'] = tmp_list;
	//==[card_type 卡片分類 END]==//

	/**
	 * [card 卡片清單]
	 * 		key 		[number] 卡片編號
	 * 		name 		[string] 顯示名稱
	 * 		real_name	[string] 真實名稱
	 * 		type 		[string] 卡種(V:VISA/M:MASTER/J:JCB)
	 * 		img 		[string] 圖片名稱
	 * 		agree		[array]  卡片的特殊同意條款
	 * 		trait 		[string] 卡片特色
	 * 		privilege 		[string] 專屬優惠
	 * @type {Object}
	 */
	tmp_list = {};
	tmp_list['894'] = {
		'key' : '894',
		'name' : '鹿港天后宮晶緻一卡通認同卡',
		'real_name' : 'JCB一卡通晶緻卡',
		'type' : 'J',
		'img' : '894.png',
		'agree' : ['spe_2','spe_4'],
		'trait' : '每張鹿港天后宮認同卡均經過香爐祈福儀式，<br>且每筆一般消費合庫另提撥0.3%回饋予鹿港天后宮，作為慈善公益用途，<br>刷卡做公益，大家一起做好事，<br>讓媽祖保佑持卡人一切平安幸福。',
		'privilege' : '全新戶首刷禮：核卡後 45天內，刷卡累積一般消費達2,999元且成功自動加值一次，即可獲得300元刷卡金。<br>滿額禮：每卡累積一般消費滿10萬元，次年可免費於鹿港天后宮點燈一年〈光明燈、文昌燈、安太歲、拜斗燈四選一〉'
	};
	tmp_list['679'] = {
		'key' : '679',
		'name' : '鹿港天后宮鈦金悠遊認同卡',
		'real_name' : 'MASTER悠遊鈦金卡',
		'type' : 'M',
		'img' : '679.png',
		'agree' : ['spe_1','spe_4'],
		'trait' : '每張鹿港天后宮認同卡均經過香爐祈福儀式，<br>且每筆一般消費合庫另提撥0.3%回饋予鹿港天后宮，作為慈善公益用途，<br>刷卡做公益，大家一起做好事，<br>讓媽祖保佑持卡人一切平安幸福。',
		'privilege' : '全新戶首刷禮：核卡後 45天內，刷卡累積一般消費達2,999元且成功自動加值一次，即可獲得300元刷卡金。<br>滿額禮：每卡累積一般消費滿10萬元，次年可免費於鹿港天后宮點燈一年〈光明燈、文昌燈、安太歲、拜斗燈四選一〉'
	};
	tmp_list['677'] = {
		'key' : '677',
		'name' : '漢來美食鈦金悠遊聯名卡',
		'real_name' : 'MASTER悠遊鈦金卡',
		'type' : 'M',
		'img' : '677.png',
		'agree' : ['spe_1','spe_4'],
		'trait' : '漢來美食系列餐廳享消費9折優惠<br>搭配悠遊卡功能，自動加值小額消費超便利',
		'privilege' : '現金回饋：國內0.3%、國外1%<br>全新戶申辦享首刷禮<br>漢來美食系列餐廳消費9折優惠<br>卡友日三人同行一人免費'
	};
	tmp_list['893'] = {
		'key' : '893',
		'name' : '漢來美食晶緻一卡通聯名卡',
		'real_name' : 'JCB一卡通晶緻卡',
		'type' : 'J',
		'img' : '893.png',
		'agree' : ['spe_2','spe_4'],
		'trait' : '漢來美食系列餐廳享消費9折優惠<br>搭配一卡通功能，自動加值小額消費超便利',
		'privilege' : '現金回饋：國內0.3%、國外1%<br>全新戶申辦享首刷禮<br>漢來美食系列餐廳消費9折優惠<br>卡友日三人同行一人免費'
	};
	tmp_list['891'] = {
		'key' : '891',
		'name' : '哆啦A夢悠遊晶緻卡',
		'real_name' : 'JCB哆啦A夢悠遊晶緻卡',
		'type' : 'J',
		'img' : '891.png',
		'agree' : ['spe_1'],
		'trait' : '可愛哆啦A夢卡面<br>搭配悠遊卡功能，自動加值小額消費超便利',
		'privilege' : '現金回饋：國內0.3%、國外1.5%<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['882'] = {
		'key' : '882',
		'name' : '哆啦A夢悠遊白金卡',
		'real_name' : 'JCB哆啦A夢悠遊白金卡',
		'type' : 'J',
		'img' : '882.png',
		'agree' : ['spe_1'],
		'trait' : '可愛哆啦A夢卡面<br>搭配悠遊卡功能，自動加值小額消費超便利',
		'privilege' : '紅利點數：每25元累積1點、1,000點折刷卡金60元<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['881'] = {
		'key' : '881',
		'name' : 'JCB悠遊白金卡',
		'real_name' : 'JCB悠遊白金卡',
		'type' : 'J',
		'img' : '881.jpg',
		'agree' : ['spe_1'],
		'trait' : '搭配悠遊卡功能，自動加值小額消費超便利',
		'privilege' : '紅利點數：每25元累積1點、1,000點折刷卡金60元<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['608'] = {
		'key' : '608',
		'name' : 'VISA悠遊白金卡',
		'real_name' : 'VISA悠遊白金卡',
		'type' : 'V',
		'img' : '608.jpg',
		'agree' : ['spe_1'],
		'trait' : '搭配悠遊卡功能，自動加值小額消費超便利',
		'privilege' : '紅利點數：每25元累積1點、1,000點折刷卡金60元<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['890'] = {
		'key' : '890',
		'name' : '悠遊晶緻卡',
		'real_name' : 'JCB悠遊晶緻卡',
		'type' : 'J',
		'img' : '890.png',
		'agree' : ['spe_1'],
		'trait' : '搭配悠遊卡功能，自動加值小額消費超便利',
		'privilege' : '現金回饋：國內0.3%、國外1.5%<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['892'] = {
		'key' : '892',
		'name' : '利high卡',
		'real_name' : 'JCB利high卡',
		'type' : 'J',
		'img' : '892.png',
		'agree' : ['spe_2'],
		'trait' : '搭配一卡通功能，自動加值小額消費超便利',
		'privilege' : '現金回饋：國、內外1%<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['620'] = {
		'key' : '620',
		'name' : '無限卡',
		'real_name' : 'VISA無限卡',
		'type' : 'V',
		'img' : '620.png',
		'agree' : [],
		'trait' : '為頂級卡友量身打造提供頂級優惠禮遇',
		'privilege' : '國內一般消費每滿20元可獲紅利點數2點<br>國外一般消費每滿20元可獲紅利點數5點<br>免費機場接送、機場貴賓室免費使用、市區停車、機場免費停車、紅利點數加倍、高額保險等多項豐厚權益。'
	};
	tmp_list['670'] = {
		'key' : '670',
		'name' : '個人商旅卡',
		'real_name' : 'MASTER個人商旅卡',
		'type' : 'M',
		'img' : '670.png',
		'agree' : [],
		'trait' : '提供凌駕白金的優渥禮遇與貼心服務',
		'privilege' : '國內一般消費每滿20元可獲紅利點數1點<br>國外一般消費每滿20元可獲紅利點數5點<br>市區停車、機場免費停車、紅利點數加倍、高額保險等多項豐厚權益。'
	};
	tmp_list['600'] = {
		'key' : '600',
		'name' : 'VISA白金卡',
		'real_name' : 'VISA白金卡',
		'type' : 'V',
		'img' : '600.png',
		'agree' : [],
		'trait' : 'VISA白金卡',
		'privilege' : '紅利點數：每25元累積1點、1,000點折刷卡金60元<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['642'] = {
		'key' : '642',
		'name' : 'MASTER白金卡',
		'real_name' : 'MASTER白金卡',
		'type' : 'M',
		'img' : '642.png',
		'agree' : [],
		'trait' : 'MASTER白金卡',
		'privilege' : '紅利點數：每25元累積1點、1,000點折刷卡金60元<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['880'] = {
		'key' : '880',
		'name' : 'JCB白金卡',
		'real_name' : 'JCB白金卡',
		'type' : 'J',
		'img' : '880.png',
		'agree' : [],
		'trait' : 'JCB白金卡',
		'privilege' : '紅利點數：每25元累積1點、1,000點折刷卡金60元<br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['630'] = {
		'key' : '630',
		'name' : '世界卡',
		'real_name' : 'MASTER世界卡',
		'type' : 'M',
		'img' : '630.png',
		'agree' : [],
		'trait' : '為頂級卡友量身打造提供頂級優惠禮遇',
		'privilege' : '國內一般消費1%現金回饋、108/6/1起一般消費每滿20 元，即可自動累積2點<br>國外一般消費2.1%現金回饋、108/6/1起一般消費享 1.6%現金回饋<br>免費機場接送、機場貴賓室免費使用、市區停車、機場免費停車、紅利點數加倍、高額保險等多項豐厚權益。'
	};
	tmp_list['610'] = {
		'key' : '610',
		'name' : '御璽商旅卡',
		'real_name' : 'VISA御璽商旅卡',
		'type' : 'V',
		'img' : '610.png',
		'agree' : [],
		'trait' : '提供凌駕白金的優渥禮遇與貼心服務',
		'privilege' : '全新戶首刷禮：核卡後 45天內，刷卡累積一般消費達2,999元且成功自動加值一次，即可獲得300元刷卡金。<br>現金回饋：國內0.3%、國外2%'
	};
	tmp_list['613'] = {
		'key' : '613',
		'name' : '活力御璽卡',
		'real_name' : '活力御璽卡',
		'type' : 'V',
		'img' : '613.jpg',
		'agree' : [],
		'trait' : '高雅的藍色調理充滿自信與大器，運用金色扇形水波紋路為招財運金的圖意，象徵精彩生活一晶彩金彩。',
		'privilege' : '國內1%現金回饋，國外2%現金回饋。全新戶核卡後45天內消費達2,020元，可獲300元回饋金。<br>申辦電子帳單另享終身免年費優惠。'
	};
	tmp_list['681'] = {
		'key' : '681',
		'name' : '鈦金icash聯名卡',
		'real_name' : 'MASTER鈦金icash聯名卡',
		'type' : 'M',
		'img' : '681.png',
		'agree' : ['spe_3','spe_4'],
		// 'trait' : '結合信用卡及icash2.0票證功能，享多功能支付及OPENPOINT累積點數',
		// 'privilege' : '活動時間：即日起至106年12月31日止<br>活動項目：<br>1.網購現金回饋3%：當月新增一般消費（不含網路消費）達3,000元以上，即可享網路消費3%現金回饋，每月回饋上限300元<br><br>2.全新戶首刷禮：全新戶（核卡前六個月內未持有本行個人信用卡者）核卡後45天內一般消費任2筆均達888元以上且成功自動加值1次，贈送150,000點OPENPOINT點數<br><br>3.代扣便利更有利：icash聯名卡持卡人首次申辦帳戶自動扣繳本行信用卡款，或首次申辦以icash聯名卡代扣繳水、電、瓦斯、中華電信任一項公用事業之費用，並於申請後90天內扣繳成功，即回饋100元刷卡金<br><br>4.申請電子帳單年費優惠：持卡人申請電子帳單享終身免年費優惠（取消電子帳單即依本卡年費標準恢復計算收取）。'
		'trait' : '結合icash票證功能，增加使用便利性，以統一超商OPENPOINT點數回饋，好康優惠點不完！',
		'privilege' : '全新戶首刷禮：全新戶(核卡前六個月內未持有本行個人信用卡者)核 卡後45天內一般消費任2筆均達888元以上且成功自動加值1次，贈送150,000點OPENPOINT點數。<br>網購現金回饋3%：當月新增一般消費（不含網路消費）達3,000元以上，即可享當月網路消費3%現金回饋，每月回饋上限300元。<br>自動加值加碼禮：每月自動加值滿3次，贈送10,000點OPENPOINT點數，每卡每月回饋上限乙次。<br>代扣便利更有利：icash聯名卡持卡人首次申辦帳戶自動扣繳本行信用卡款，或首次申辦以icash聯名卡代扣繳水、電、瓦斯、中華電信任一項公用事業之費用，並於申請後90天內扣繳成功，即回饋100元刷卡金。<br>申請電子帳單年費優惠：持卡人申請電子帳單，icash聯名卡享終身免年費優惠（取消電子帳單即依本卡年費標準恢復計算收取）。'
	};
	tmp_list['684'] = {
		'key' : '684',
		'name' : '卡娜赫拉夢想鑽現卡',
		'real_name' : 'MASTER鈦金icash聯名卡－夢想',
		'type' : 'M',
		'img' : '684.png',
		'agree' : ['spe_3'],
		'trait' : '以現金回饋為主，搭配可愛的卡娜赫拉小動物卡面，並結合icash票證功能，小額消費超便利！',
		'privilege' : '即日起~107/12/31止<br />國內、外一般消費享1%現金回饋，回饋無上限。<br />網路消費享3%現金回饋(含原回饋1%)，每月回饋上限300元。<br />核卡後首次自動加值送30,000點OPENPOINT點數。<br />全新戶(核卡前六個月內未持有本行個人信用卡者)核卡後45天內一般消費任2筆均達888元以上且成功自動加值1次，贈送卡娜赫拉牛奶鍋乙只。'
	};
	tmp_list['685'] = {
		'key' : '685',
		'name' : '卡娜赫拉幸福鑽點卡',
		'real_name' : 'MASTER鈦金icash聯名卡－幸福',
		'type' : 'M',
		'img' : '685.png',
		'agree' : ['spe_3'],
		'trait' : '可愛的卡娜赫拉小動物卡面，結合icash票證功能，增加使用便利性，以統一超商OPENPOINT點數回饋，好康優惠點不完！',
		'privilege' : '即日起~107/12/31止<br />國內、外一般消費每NT$1可累積3點OPENPOINT點數。<br />天天合庫日：7-11門市消費不限金額天天可享點數10倍送之優惠，回饋無上限。<br />全新戶(核卡前六個月內未持有本行個人信用卡者)核卡後45天內一般消費任2筆均達888元以上且成功自動加值1次，贈送卡娜赫拉牛奶鍋乙只。'
	};
	tmp_list['686'] = {
		'key' : '686',
		'name' : '台北市第五信用合作社聯名卡',
		'real_name' : '台北市第五信用合作社聯名卡',
		'type' : 'M',
		'img' : '686.jpg',
		'agree' : ['spe_4','spe_1'],
		'trait' : '結合電子票證具支付便利性，提供卡友「一卡在手，隨處悠遊」便利又貼心的服務。',
		'privilege' : '國內一般消費享0.5%現金回饋，國外消費享1.5%現金回饋，另有免費道路救援，刷團費或機票全額享免費機場停車每年4次、每次8天、高額旅遊平安險及滿額免費市區停車。'
	};
	tmp_list['678'] = {
		'key' : '678',
		'name' : '鈦金悠遊聯名卡',
		'real_name' : 'MASTER鈦金悠遊聯名卡',
		'type' : 'M',
		'img' : '678.jpg',
		'agree' : ['spe_1','spe_4'],
		'trait' : '搭配悠遊卡功能，自動加值小額消費超便利',
		'privilege' : '國內當月一般消費新臺幣（以下同）19,999元以內享0.5%，20,000元~39,999元享0.8%，40,000元<br>以上享1%<br>國外消費享1.5%<br><br>免費道路救援<br>刷團費或機票全額享免費機場停車每年4次、每次8天<br>高額旅遊平安險<br>滿額免費市區停車'
	};
	tmp_list['680'] = {
		'key' : '680',
		'name' : '宜蘭信合社聯名卡',
		'real_name' : '宜蘭信合社聯名卡',
		'type' : 'M',
		'img' : '680.jpg',
		'agree' : ['spe_4','spe_1'],
		'trait' : '卡別為MASTERCARD鈦金悠遊聯名卡，結合電子票證具支付便利性，提供卡友「一卡在手．隨處悠遊」便利又貼心的服務。',
		'privilege' : '1.新戶首刷禮：全新戶於核卡後45天內，一般消費達2,999元以上，可獲300元刷卡金，限正卡回饋。<br>2.高額現金回饋：國內一般消費享0.5%回饋／國外一般消費享1.5%回饋'
	};
	tmp_list['682'] = {
		'key' : '682',
		'name' : '彰化第五信用合作社聯名卡',
		'real_name' : '彰化第五信用合作社聯名卡',
		'type' : 'M',
		'img' : '682.jpg',
		'agree' : ['spe_4','spe_1'],
		'trait' : '卡別為MASTERCARD鈦金悠遊聯名卡，結合電子票證小額支付，提供多元化支付的便利性，藉由推廣、行銷與加深彰化印象，間接促進彰化的觀光效益。',
		'privilege' : '1.新戶首刷禮：全新戶於核卡後45天內，一般消費達2,999元以上，可獲300元刷卡金，限正卡回饋。<br>2.高額現金回饋：國內一般消費享0.5%回饋／國外一般消費享1.5%回饋。'
	};
	tmp_list['683'] = {
		'key' : '683',
		'name' : '高雄第三信用合作社聯名卡',
		'real_name' : '高雄第三信用合作社聯名卡',
		'type' : 'M',
		'img' : '683.png',
		'agree' : ['spe_4','spe_2'],
		'trait' : '結合一卡通電子票證支付的便利性，讓卡友一卡在手即可行遍全臺。',
		'privilege' : '1.新戶首刷禮：全新戶於核卡後45天內，一般消費達2,999元以上，可獲300元刷卡金，限正卡回饋。<br>2.高額現金回饋：國內一般消費享0.5%回饋／國外一般消費享1.5%回饋<br>3.申請電子帳單年費優惠：持卡人申請電子帳單終身免年費（取消電子帳單即依本卡年費標準恢復計算收取）'
	};
	tmp_list['687'] = {
		'key' : '687',
		'name' : '臺中科技大學認同卡',
		'real_name' : '臺中科技大學認同卡',
		'type' : 'M',
		'img' : '687.jpg',
		'agree' : ['spe_4','spe_1'],
		'trait' : '卡別MASTERCARD鈦金悠遊聯名卡，結合電子票證具支付便利性，提供卡友「一卡在手，隨處悠遊」便利又貼心的服務。',
		'privilege' : '1.全新戶首刷禮：全新戶於核卡後45天內，一般消費滿2,999元（含）以上，可得300元刷卡金。<br>2.現金回饋無門檻無上限：國內一般消費享1%現金回饋；國外享1.5%現金回饋。<br>3.免年費優惠。'
	};
	tmp_list['511'] = {
		'key' : '511',
		'name' : '兆福電子商務聯名卡(個人)',
		'real_name' : '兆福電子商務聯名卡(個人)',
		'type' : 'Ｍ',
		'img' : '511.png',
		'agree' : ['spe_4'],
		'trait' : '限社區藥局於兆福電子商務採購平台採購使用。',
		'privilege' : ''
	};
	// tmp_list['680'] = {
	// 	'key' : '680',
	// 	'name' : '宜蘭信合社聯名卡',
	// 	'real_name' : '宜蘭信合社聯名卡',
	// 	'type' : 'Ｍ',
	// 	'img' : '680.png',
	// 	'agree' : ['spe_1','spe_4'],
	// 	'trait' : '1.新戶首刷禮：全新戶於核卡後45天內，一般消費達2,999元以上，可獲300元刷卡金，限正卡回饋。<br>2.高額現金回饋：國內一般消費享0.5%回饋／國外一般消費享1.5%回饋',
	// 	'privilege' : '卡別為MASTERCARD鈦金悠遊聯名卡，結合電子票證具支付便利性，提供卡友「一卡在手．隨處悠遊」便利又貼心的服務。'
	// };
	// tmp_list['682'] = {
	// 	'key' : '682',
	// 	'name' : '彰化五信聯名卡',
	// 	'real_name' : '彰化五信聯名卡',
	// 	'type' : 'Ｍ',
	// 	'img' : '682.png',
	// 	'agree' : ['spe_1','spe_4'],
	// 	'trait' : '1.新戶首刷禮：全新戶於核卡後45天內，一般消費達2,999元以上，可獲300元刷卡金，限正卡回饋。<br>2.高額現金回饋：國內一般消費享0.5%回饋／國外一般消費享1.5%回饋',
	// 	'privilege' : '卡別為MASTERCARD鈦金悠遊聯名卡，結合電子票證小額支付，提供多元化支付的便利性，藉由推廣、行銷與加深彰化印象，間接促進彰化的觀光效益。'
	// };
	tmp_list['614'] = {
		'key' : '614',
		'name' : '樂活悠遊聯名卡',
		'real_name' : '樂活悠遊聯名卡',
		'type' : 'M',
		'img' : '614.jpg',
		'agree' : ['spe_1','spe_4'],
		'trait' : '為樂活族群提供全方位關護禮遇。',
		'privilege' : '發卡首年國內最高5%、國外2%現金回饋。'
	};

	cardDataList['card'] = tmp_list;
	//==[card 卡片清單 END]==//

	/**
	 * [整理卡片卡種到card_type內]
	 */
	for(key in cardDataList['card']){
		var card_data = cardDataList['card'][key];
		if(typeof cardDataList['card_type'][card_data.type] !== 'undefined'){
			cardDataList['card_type'][card_data.type]['sub'].push(key);
		}
	}

	return cardDataList;
});
