/**
 * 存款的帳戶別代碼
 * ※EAI台幣存款歸戶查詢
 *      CK:支票存款
 *      FD:定期存款
 *      MB:綜合存款
 *      PB:活期存款
 *      GD:黃金存摺
 *  ※匯入匯款歸戶查詢
 *      CK:支票存款
 *      MB:綜合存款
 *      PB:活期存款
 *  ※網銀、語音掛失類歸戶查詢
 *      MB:綜合存款
 *      PB:活期存款
 *
 * 898, 899因為兼具綜合存款、外匯、基金、黃金存摺
 */
export const DepositTypeSet = {
    // 全系統
    'ALL': {
        // 帳戶別代碼 對應名稱 (若有需要轉換時)
        'TYPE': {
            'CK': '支票存款',
            'FD': '定期存款',
            'MB': '綜合存款',
            'PB': '活期存款',
            'XS': '外幣活期存款',
            'XM': '外幣綜合存款',
            'XF': '外幣定期存款',
            'XFS': '外幣綜定存',
            'GD': '黃金存摺'
        },
        'lastTrnsDate': {
            // 顯示定存到期日的欄位：(XFS 好像是定存)
            'expirationDate': ['FD', 'XF', 'XFS']
        },
        // 帳號(13位)5-7碼
        'accountType': {
            // // 黃金存摺
            '898': '財富管理',
            '899': '財富管理',
            '590': '黃金存摺'
        }
    },
    // [台幣存款]指定存款類別
    'TW': {
        // 帳戶別代碼 對應名稱 (若有需要轉換時) => native:CurrentAndSavesAcct
        'TYPE': {
            'CK': '台幣支票存款',
            'PB': '台幣活期性存款',
            'XS': '台幣活期性存款',
            'MB': '台幣綜合性存款',
            'XM': '台幣綜合性存款',
            'FD': '台幣定期性存款',
            'XF': '台幣定期性存款'
        },
        'lastTrnsDate': {
            // 顯示定存到期日的欄位：(XFS 好像是定存)
            'expirationDate': ['FD', 'XF', 'XFS']
        },
        // 帳號(13位)5-7碼
        'accountType': {
        }
    },
    // [台幣存款總覽列表]顯示帳號類別
    'TW_list': {
        // 帳戶類別代碼 對應名稱
        'TYPE': {
            'CK': '支票存款',
            'PB': '活期存款',
            'XS': '活期存款',
            'MB': '綜合存款',
            'XM': '綜合存款',
            'FD': '定期存款',
            'XF': '定期存款'
        }
    },
    // [台幣存款明細頭檔]顯示帳號類別
    'TW_header': {
        // 帳戶類別代碼 對應名稱
        'TYPE': {
            'CK': '台幣<br>支票存款',
            'PB': '台幣<br>活期性存款',
            'XS': '台幣<br>活期性存款',
            'MB': '台幣<br>綜合性存款',
            'XM': '台幣<br>綜合性存款',
            'FD': '台幣<br>定期性存款',
            'XF': '台幣<br>定期性存款'
        }
    },
    // [外匯存款]指定存款類別
    'FOREX': {
        // 帳戶別代碼 對應名稱 (若有需要轉換時)
        'TYPE': {
            'XS': '外幣活存',
            'XM': '外幣綜存',
            'XF': '外幣定存',
            'XFS': '外幣綜定存'
        },
        'lastTrnsDate': {
            // 顯示定存到期日的欄位：(XFS 好像是定存)
            'expirationDate': ['XF', 'XFS']
        },
        // 帳號(13位)5-7碼
        'accountType': {
        }
    },
    // [黃金存款]指定存款類別
    'GOLD': {
        // 帳戶別代碼 對應名稱 (若有需要轉換時)
        'TYPE': {
        },
        'lastTrnsDate': {
            // 顯示定存到期日的欄位：(GOLD先關閉)
            'expirationDate': null
            // 'expirationDate': []
        },
        // 帳號(13位)5-7碼
        'accountType': {
            // 黃金存摺
            '898': '財富管理',
            '899': '財富管理',
            '590': '黃金存摺'
        }
    },
    // [基金]指定存款類別: 但基金不是存款，可能不適用
    'FUND': {
        // 帳戶別代碼 對應名稱 (若有需要轉換時)
        'TYPE': {
        },
        'lastTrnsDate': {
            // 顯示定存到期日的欄位：(XFS 好像是定存)
            'expirationDate': []
        },
        // 帳號(13位)5-7碼
        'accountType': {
        }
    }

};
